emd-mongo-spring-soap-provider/src/test/resources/countries.xml

<soapenv:Envelope
    xmlns:emd="llc:jaradatbros:emd:api:soap:mongo"
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header />
    <soapenv:Body>
        <emd:GetCountryRequest>
            <emd:name>Japan</emd:name>
        </emd:GetCountryRequest>
    </soapenv:Body>
</soapenv:Envelope>